{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_1", "filters": 32, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 256, 256, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_2", "filters": 32, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 128, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 4, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}