{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "activation": "relu", "batch_input_shape": [null, 256, 256, 3], "padding": "valid", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "padding": "valid", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 128, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "units": 4, "activation": "softmax", "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}