{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "use_bias": true, "name": "conv2d_5", "bias_constraint": null, "padding": "valid", "trainable": true, "batch_input_shape": [null, 256, 256, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_5", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "use_bias": true, "name": "conv2d_6", "filters": 32, "padding": "valid", "trainable": true, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_6", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_5", "bias_constraint": null, "units": 128, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "name": "dense_6", "bias_constraint": null, "units": 3, "bias_regularizer": null, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}